




234567345673
5325235
325235
123 # integer целые числа
-3323

"Hello!" # string строки
"ПРОЛД;%:?*(№;%:?*(DFGHJK😃😎😋🍞"

True  # bool логический тип или булевый
False


[1, 345, "GHJ#$", True, [234,67]]  # list список

# print(2 + 2)
# print(3 * 33)
# print("SUPER\n" * 1000)

# Операторы сравнения
# > больше
# < меньше
# >=больше или равно
# <=меньше или равно
# == равно
# != не равно

# Операторы сравнения применяются к данным
# (строкам, числам, спискам, булевым и т.д)

# результатом выражений с операторами сравнения
# всегда будет логический тип данных


print(1 == 0)
print(True == False)
print(False == False)
print(23 > 222)
print("!@#$%123" == "!@#$%^&*")
print("!@#$%123" != "!@#$%^&*")

# Где булевый тип используется?

# ЦИКЛАХ
# УСЛОВИЯХ


# if False:
#     print('Hello!')
#     print('Hello!')
#     print('Hello!')
# else:
#     print("Bye!")
#
# password = "12345"
# if password == "12345":
#     print("Пароль верный")
# else:
#     print("Пароль неверный")


# password = input("Введите пароль:")
# if password == "12345":
#     print("Пароль верный")
# else:
#     print("Пароль неверный")

# ЦИКЛ WHILE или цикл с условием
# WHILE переводится "До тех пор пока" что-то True

password = input("Введите пароль:")
while password != "12345":
    print("пароль не верный введите ещё раз")
    password = input("Введите пароль:")

print("Пароль верный вы вошли в систему!")






